{
    "faculty_members": [
        {
            "id": "scambat",
            "name": "Dr. Shaneth Ambat",
            "image": "placeholder-image.png",
            "bio": "Dr. Shaneth C. Ambat serves as the Director of the Computer Science Program at FEU Institute of Technology in Sampaloc Manila. Previously, she held positions as the Dean of Graduate Studies and College of Computer Studies at AMA University in Quezon City. Dr. Ambat's research interests include a variety of topics in computer science such as Self Organizing Map, Reinforcement Learning Algorithm, Fuzzy Logic, Machine Learning, Data Envelopment Analysis, Ontology, Image Processing, and Computer Vision. Dr. Shaneth C. Ambat serves as the Director of the Computer Science Program at FEU Institute of Technology in Sampaloc Manila. Previously, she held positions as the Dean of Graduate Studies and College of Computer Studies at AMA University in Quezon City. Dr. Ambat's research interests include a variety of topics in computer science such as Self Organizing Map, Reinforcement Learning Algorithm, Fuzzy Logic, Machine Learning, Data Envelopment Analysis, Ontology, Image Processing, and Computer Vision. Dr. Shaneth C. Ambat serves as the Director of the Computer Science Program at FEU Institute of Technology in Sampaloc Manila. Previously, she held positions as the Dean of Graduate Studies and College of Computer Studies at AMA University in Quezon City. Dr. Ambat's research interests include a variety of topics in computer science such as Self Organizing Map, Reinforcement Learning Algorithm, Fuzzy Logic, Machine Learning, Data Envelopment Analysis, Ontology, Image Processing, and Computer Vision.",
            "quote": "[DEMO TEXT] Congratulations! You have taken the first step to a better future. I am here to help you achieve your goals."
        },
        {
            "id": "jodoe",
            "name": "John Doe",
            "image": "placeholder-image.png",
            "bio": "The quick brown fox jumps over the lazy dog.",
            "quote": "[DEMO TEXT] Congratulations! You have taken the first step to a better future. I am here to help you achieve your goals. Again, congratulations!"
        },
        {
            "id": "jadoe",
            "name": "John Doe",
            "image": "placeholder-image.png",
            "bio": "Whereas disregard and contempt for human rights have resulted",
            "quote": "[DEMO TEXT] Congratulations! You have taken the first step to a better future. I am here to help you achieve your goals. Again and again, congratulations!"
        }
    ]
}