{
    "4bytes": {
        "slug": "4bytes",
        "group_name": "4Bytes",
        "poster": "4Bytes.png",
        "title": "LOC8TE: A Velocity Renovation and Google API as Geofencing Professional Locator & Virtual Space",
        "abstract": "The thesis study was formulated by the proponents to help locate professionals that are near a specific individual and communicate with them. Correspondingly, it will also help various professionals to establish connections and trust with the clients who connect with them. Using the Google API, and the Android operating system while applying the Kanban scheduling system upon building the software, the proponents developed a mobile application that will locate professionals on the map and can be filtered based on their category (8 professions) or their distance-by-radius (the user is the center of the circle). It also lets the clients view the profile of the professionals which contains relevant details such as their ratings about them, experiences, skills, and others. Further, once a client connects with professionals, then he or she will be able to chat with them. There is also an event feature that will let professionals create events that can be configured to allow clients or only their fellow professionals to participate in them. Moreover, the proponents surveyed 30 respondents, consisting of 15 clients and 15 professionals. The respondents rated the application with a weighted mean of 4.78 in terms of Functionality which is equivalent to 'Excellent' and it can be inferred that it is useful for both clients and professionals. Future researchers can enrich the proponents' study by using other shortest-path algorithms which have a faster time complexity than O(V^3), wherein V is the total number of vertices. Also, utilize SQL databases (i.e., MySQL, PostgreSQL, etc.) with a proper design in order to query swiftly.",
        "description": "An android application aimed at connecting individuals with nearby professionals and facilitating communication between them. It enables professionals to build relationships and establish trust with clients by showcasing their profiles, which include information such as ratings, experiences, skills, and more. Moreover, clients can view the profiles of the professionals and initiate communication once a connection is established. Lastly, there is a feature which lets professionals organize events so that other professionals and clients can participate in it.",
        "group_photo": "4Bytes",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "Mark Jason Galang",
                "photo": ".png"
            },
            {
                "name": "Mary Angeline Corral",
                "photo": ".png"
            },
            {
                "name": "Allen Christopher Dela Rosa",
                "photo": ".png"
            },
            {
                "name": "Joshua Matthew Padilla",
                "photo": ".png"
            }
        ]
    },
    "4horsemen": {
        "slug": "4horsemen",
        "group_name": "4Horsemen",
        "poster": "4Horsemen.png",
        "title": "EmoBot: A Depression Prevention Android App using Machine Learning",
        "abstract": "",
        "description": "EmoBot is a one-of-a-kind android application designed to help you apply effective strategies for preventing incoming depression. EmoBot draws upon the principles and techniques of Cognitive Behavior Therapy (CBT), one of the most effective and scientifically-supported methods of psychotherapy. With four integrated tools, EmoBot helps you to engage in mood-enhancing activities, identify and change unhealthy thinking, rate and chart mood and hobbies across time, and give someone that will listen and talk about their problem.",
        "group_photo": "4Horsemen",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "William Vincent Talaña",
                "photo": ".png"
            },
            {
                "name": "Mark Daniel Sumatra",
                "photo": ".png"
            },
            {
                "name": "Sean Kobe Adawag",
                "photo": ".png"
            },
            {
                "name": "Miguel Angelo Bartolome",
                "photo": ".png"
            }
        ]
    },
    "alphabeta": {
        "slug": "alphabeta",
        "group_name": "AlphaBeta",
        "poster": "AlphaBeta.png",
        "title": "Liwanag: Emotion Recognition Using Facial Expression for the Visually Impaired",
        "abstract": "The goal of this study was to develop an Android mobile application entitled 'Liwanag' that enables visually impaired individuals to use facial recognition to determine the emotion of the person they are interacting with. Face recognition has been used in earlier studies using a variety of methods and algorithms and through this, the application combined 5 algorithms for facial and emotion detection; the detected and analyzed captured input was processed with the use of Viola-Jones algorithm and Haar-like features. The emotions represented will then be determined by feature extraction using HOG and LBP. Lastly, the detected face will be categorized using SVM into categories that specify the emotions it expresses. Liwanag caters 18 emotions that are composed of 7 basic emotions and 11 compound emotions. The application was tested by 50 respondents that are composed of visually impaired, IT/CS professionals, and psychology professionals to evaluate the overall functionality of the application. The overall accuracy of the application attained 56%, still, the overall rating of the application based on the respondents is 5.83 out of 7. This rating reflects as Agree. The proponents advised future researchers to use different classification algorithm aside from SVM, adding features such as basing the predicted expression based on the tone of the voice, being able to recognize the person they are talking to, giving the user an option to choose the time of interval between predictions, and lastly, to fully integrate all the components into one by using compatible frameworks to make the application independent.",
        "description": "Liwanag is an android mobile application that gives the visually impaired an access to non-verbal communication specifically facial expression by determining the emotion presented on the face of the person whom the visually impaired is talking to with the use of the rear camera of the phone.",
        "group_photo": "AlphaBeta",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "Ralph Edchris Salmorin",
                "photo": "55.png"
            },
            {
                "name": "Kathlene Jane Roxas",
                "photo": "50.png"
            },
            {
                "name": "Richard Neil Punzalan",
                "photo": "57.png"
            },
            {
                "name": "Vernes Abella",
                "photo": "53.png"
            }
        ]
    },
    "bamm": {
        "slug": "bamm",
        "group_name": "BAMM",
        "poster": "BAMM.png",
        "title": "FIREph: Budget Planner Application using Regression Algorithms",
        "abstract": "",
        "description": "FirePH is a financial management tool that uses regression and time-series forecasting algorithms to help users track and forecast their expenses. The application includes modules for inserting transactions, retrieving and displaying transactions, forecasting transactions, generating reports, managing expenses, and offering credential verification. The application serves to help users become more aware of their expenditures and identify areas where they can reduce their spending.",
        "group_photo": "BAMM",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "Mohammad Noor",
                "photo": ".png"
            },
            {
                "name": "Ma. Alexies Mae de Lara",
                "photo": ".png"
            },
            {
                "name": "Marc Ivan Guillermo",
                "photo": ".png"
            }
        ]
    },
    "bethesdaboys": {
        "slug": "bethesdaboys",
        "group_name": "Bethesda Boys",
        "poster": "Bethesda-Boys.jpg",
        "title": "Codex Learning: A Game-Based Intelligent Tutoring System using Expert-Based Modeling to Measure the Skills and Knowledge of Novice Programmers in Java Programming",
        "abstract": "",
        "description": "A retro styled gamified desktop application that teaches the Fundamentals of Java Programming Language (JPL). The application collects the value of the skills and knowledge of novice programmers through theoretical -Question and Answer- and practical -Place the block- activities. This application is built to inspire and teach novice programmers to know the basics and proper placement of code components of JPL.",
        "group_photo": "Bethesda Boys",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "Richmond Jyron Esguerra",
                "photo": ".png"
            },
            {
                "name": "Paul Bryan Co",
                "photo": ".png"
            },
            {
                "name": "Aaron John Fernandez",
                "photo": ".png"
            },
            {
                "name": "Aldreck Argueza",
                "photo": ".png"
            }
        ]
    },
    "brocode": {
        "slug": "brocode",
        "group_name": "BroCode",
        "poster": "BroCode.png",
        "title": "License Plate Recognition with Violation Checker Using Yolo and Tesseract-CNN Algorithm",
        "abstract": "",
        "description": "A web based application that uses YOLO and Tesseract-CNN algorithms to detect license plate numbers through video feeds. This mainly benefits drivers and traffic officials. An authorized administrator can perform CRUD operations on car and violation data. Additionally, there is a violation checker that allows vehicle owners to input their engine number. Selected traffic officals can receive SMS notifications about detected hot plates and related information, while vehicle owners can receive notifications if they have been issued a violation.",
        "group_photo": "BroCode",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "Mark Angelo Capili",
                "photo": ".png"
            },
            {
                "name": "Emanuelle Bermudo",
                "photo": ".png"
            },
            {
                "name": "Vincent Adrian Lim",
                "photo": ".png"
            },
            {
                "name": "Ruth De Guzman",
                "photo": ".png"
            }
        ]
    },
    "codeeldrick": {
        "slug": "codeeldrick",
        "group_name": "CodeEldrick",
        "poster": "CodeEldrick.jpg",
        "title": "(B.M.A) Android/iOS Budget Monitoring Application using Predictive Analytics",
        "abstract": "",
        "description": "BMA is a mobile application designed to help users monitor their budget and give them a glimpse of what could be their future expenditure with the help of AI. It features a predictive AI that gives the user an estimate of what could be their future expense based on the user's past data. It also has an OCR function to make it easier for the users to input their expense by taking a picture of receipts and it goes directly to our database which the user can also see inside the App.",
        "group_photo": "CodeEldrick",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "Eldrick Marasigan",
                "photo": ".png"
            },
            {
                "name": "Domingo Kyle",
                "photo": ".png"
            },
            {
                "name": "Shiela Bellosillo",
                "photo": ".png"
            },
            {
                "name": "Mark Bernard Estrada",
                "photo": ".png"
            }
        ]
    },
    "codepanda": {
        "slug": "codepanda",
        "group_name": "CodePanda",
        "poster": "CodePanda.png",
        "title": "Grocery Dash: A Mobile-based Grocery Shopping Assistant with the Application of the Hamiltonian Path Problem of Graph Theory",
        "abstract": "Grocery shopping can often be viewed as a chore by most people, specifically men, especially if an individual does not know where a specific item that they need is located. An average shopping trip lasts for 41 minutes, and an average shopper spends more than 53 hours a year in a grocery store. Existing solutions for this problem may include online shopping, wherein a user may check-out from a particular store using a website or an application, and have it delivered directly at his or her home. However, this also does not solve the problem for people who prefer to shop on-site for a more personalized experience, as well as the staff of grocery services, since even though the buyer was able to place a grocery order online, the assigned grocery store would still need to gather the respective items. The researchers then decided to create a system that aims to reduce the total time spent and distance traveled, by generating a route inside the store that gathers all the user’s needed items. The said system made use of a heuristic that is based algorithms used for graph traversal and pathfinding algorithms, such as the A* Algorithm and 2-Opt Algorithm, as well as an implementation of the Apriori Algorithm for frequently bought products recommendation. A comparison was made between a shopper with the application and a shopper without the application, using a randomized list of ten items. The researchers found that it is indeed faster to gather a certain list of items using the application, and there is a very significant difference when it comes to the total distance traveled inside the store. The application was then evaluated based on the standards of the ISO-9126, and garnered an average rating of 4.66, with the Usability and Effectiveness category gathering the highest scores, and the Maintainability category gathering the lowest scores.",
        "description": "An android application that allows on-site grocery shoppers to list their desired items, view the total price, check for item suggestions, and follow a generated sub-optimal path for gathering all of their grocery needs. Developed using Java and Google Firebase, Grocery Dash incorporates various algorithms for pathfinding, graph traversal, and shortest path problems to help its users navigate the grocery store.",
        "group_photo": "CodePanda",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "Karl Matthew Parafina",
                "photo": "17.png"
            },
            {
                "name": "Charles Dune Villegas",
                "photo": "11.png"
            },
            {
                "name": "Angelika Gene Reyes",
                "photo": "9.png"
            },
            {
                "name": "Daniel Luis De Torrontegui",
                "photo": "15.png"
            }
        ]
    },
    "complaintcenter": {
        "slug": "complaintcenter",
        "group_name": "Complaint Center",
        "poster": "Complaint-Center.png",
        "title": "An Android Application for Symptom Awareness of Measles, Mumps, and Rubella with Digital Rash Image Detection",
        "abstract": "",
        "description": "SKIP is an android application that provides information to users about the importance of MMR vaccine. Information such as symptoms and incubation period of diseases like measles, mumps, and rubella will be available to users. The application also provides a list of locations as well as the contact information of hospitals and clinics that provide the MMR vaccine. An additional feature of the application is to classify whether the skin is healthy or not.",
        "group_photo": "Complaint Center",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "Kyle Christian Rillera",
                "photo": ".png"
            },
            {
                "name": "Aaron Kyle Hernandez",
                "photo": ".png"
            },
            {
                "name": "Crispin Tubon",
                "photo": ".png"
            },
            {
                "name": "Angelica Desales",
                "photo": ".png"
            }
        ]
    },
    "dijamcoandfriends": {
        "slug": "dijamcoandfriends",
        "group_name": "Dijamco and Friends",
        "poster": "Dijamco-and-Friends.png",
        "title": "Facial Recognition Attendance System Using Line Detection Algorithm",
        "abstract": "",
        "description": "An attendance system that provides a touch-less alternative to other personnel monitoring methods, especially to manual methods still used today. This is done by utilizing object detection and facial recognition models, in conjunction with a line detection algorithm to create a system whose operation is triggered by a user's proximity to the camera, while also being able to recognize users despite the presence of face masks. A web-based application is also created to facilitate user/admin functionalities.",
        "group_photo": "Dijamco and Friends",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "Adrianne Magracia",
                "photo": ".png"
            },
            {
                "name": "Dave Bornilla",
                "photo": ".png"
            },
            {
                "name": "Carl Michael Dijamco",
                "photo": ".png"
            },
            {
                "name": "Lorenze Dionell Arroyo",
                "photo": ".png"
            }
        ]
    },
    "direckt": {
        "slug": "direckt",
        "group_name": "DIREckt",
        "poster": "DIREckt.png",
        "title": "iAksyonPadayon.ph: Emergency Assistance Communication Tracker for Fire, Calamities and Accidents Rescue Application for City Disaster Risk and Rescue Management Office (CDRRMO) in Catbalogan City, Samar using Dijkstra's Algorithm",
        "abstract": "The advancement of technological tools and devices has enhanced the lives of people all around the world. The developer created the iAksyonPadayon.ph during this research to provide effective and efficient rescue operations to residents in the event of emergencies and disasters. The rapid reaction and activities of the many command centers include safety and security for their people by disseminating correct information on safer places and guidance on what to do when an emergency or disaster occurs through the use of this application. The user requests assistance using the application, and upon verification, the cooperating agencies will respond immediately via the Global Positioning System (GPS) and Dijkstra Algorithm. The application provides users with immediate access and functionality in response to an emergency in Catbalogan City, Samar, which will provide a direct call to the CDRRMO using the panic buttons provided in the mobile application to alert the responder and immediately locate the person who requires assistance using the Global Positioning System (GPS). The application helps the community by utilizing the capabilities of mobile and smartphone devices for Catbaloganon's emergency demands. Through assessment, the built application satisfies the demands of the users, making it user-friendly for the selected population.",
        "description": "iAksyonPadayon.ph is an application dedicated to assisting the people of Catbalogan city samar and the CDRRMO. iAksyonPadayon.ph provides multiple features, from the option Pag-Andam, which discusses the do’s and don’ts on certain scenarios and calamities, Pag-Likas, which displays information on the nearest areas of interest in case of calamities and/or emergencies and displays alternate paths towards the location in case of hindrances. Lastly, Pag-Arobulig, which is used to report and capture scenarios that will be sent to the CDRRMO.",
        "group_photo": "DIREckt",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "Jose Rafael Cruz",
                "photo": "39.png"
            },
            {
                "name": "Alec Bryan Sison",
                "photo": "35.png"
            },
            {
                "name": "Rovinjan Medrano",
                "photo": "36.png"
            },
            {
                "name": "Lealyn Rose Froilan",
                "photo": "41.png"
            }
        ]
    },
    "edith": {
        "slug": "edith",
        "group_name": "EDITH",
        "poster": "EDITH.jpg",
        "title": "Chop-In: An Intelligent Piano Performance Assessment Tool using Pattern Matching Algorithms",
        "abstract": "",
        "description": "Chop-In is an assessment tool that utilizes MIDI Technology to break down piano performances into smaller components. This application allows users to connect their piano to a computer and practice music pieces using piano roll notation. The system delivers insightful feedback containing reports about accuracy, timing, and errors with the use of a fuzzy matching algorithm. Chop-In allows piano users to assess themselves and track their progress along with their mastery of specific piano pieces",
        "group_photo": "EDITH",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "Jared Lester Huna",
                "photo": "109.png"
            },
            {
                "name": "Francis Keanu Ventura",
                "photo": "112.png"
            },
            {
                "name": "Jerome Felicilda",
                "photo": "117.png"
            },
            {
                "name": "Neille Cedrick Juan",
                "photo": "115.png"
            }
        ]
    },
    "grabcode": {
        "slug": "grabcode",
        "group_name": "GrabCode",
        "poster": "GrabCode.png",
        "title": "SMR: Image Digitization, Recognition, and Conversion of Sheet Music",
        "abstract": "Sheet music is objective and straightforward, yet intricate in its structure and nuances. It represents the ideal medium for conferring the subtle properties of music such as rhythm, tempo, pitch, sequencing, and sizeable variations of accidentals. Different image recognition software for sheet music exists today; the field coined Optical Music Recognition (OMR). This enables immediate understanding of a piece's musical composition. To improve upon this, the proponents aimed to implement editing functionality towards a scanned sheet music score after processing the initial sheet music image through ABC notation. Recognition of individual musical components such as notes, pitch, and rhythm will further support the user's learning experience with music and assess the modulation of personal music theory ideas. Further cementing the understanding of sheet music, the user will also be presented with the option of finding similar sounding scores through a local database of previously scanned sheet music. The first option compares the track's base statistics such as composer, genre, tempo, etc. For the second option, The proponents utilized Parson's code; A phonetic system of identifying melodic patterns by identifying the tendency of the pitch to go up or down. String matching algorithms compared each track's Parson's code to evaluate its melodic similarity among one another. The system was able to achieve an accuracy of 92.56% in detection of note heads across nine image samples of three test cases each. Inconsistencies in note recognition often occurred in clumped note heads across a tight vertical plane along a staff line. Software assessment across performance, reliability, portability, functionality, and usability achieved an overall score of 4.82 among 50 respondents. Moving forward, improvement in the OMR algorithms will enable further accuracy in complex, contemporary style sheet music. Along with this, general frontend improvements will greatly hone the software, such as realtime editing of musical components during playback will further improve upon the user's experience for efficiency. ",
        "description": "SMR is an application wherein proponents can convert an image into digital audio while maximizing the potential of the edit function. Once the image is converted through image processing and machine learning, the users can use the application to hear the musical output of the sheet, and view recommended similar music through comparing the metadata or melody to other songs inside the application’s database. In the end, it can be exported to a playable audio format and/or a digital image.",
        "group_photo": "GrabCode",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "Michael Anthony Kho",
                "photo": "19.png"
            },
            {
                "name": "Earl Zeann Lumanlan",
                "photo": "13.png"
            },
            {
                "name": "Genesis Charles Tan",
                "photo": "24.png"
            },
            {
                "name": "Sophia Abbyghaile Tandoc",
                "photo": "21.png"
            }
        ]
    },
    "hblhbldrivers": {
        "slug": "hblhbldrivers",
        "group_name": "HBL-HBL Drivers",
        "poster": "HBL-HBL-Drivers.png",
        "title": "Project SavvyMo: Tagalog Transcribing Web Application through the use of Convolutional Neural Network and Long Short-term Memory",
        "abstract": "",
        "description": "SavvyMo is an automated Tagalog transcriber web application that converts spoken Tagalog speech into written text. Users can upload audio or video files, and the application uses speech recognition technology to transcribe the speech into text. The output is then displayed, and users can choose to edit or export the transcribed text. SavvyMo is designed to provide convenience, especially for those researchers and those who are not fluent in Tagalog as it saves time and effort compared to manual transcription.",
        "group_photo": "HBL-HBL Drivers",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "Maegan Therese Gabriana",
                "photo": ".png"
            },
            {
                "name": "Dianne Yael Cabrales",
                "photo": ".png"
            },
            {
                "name": "Janezen Dagami",
                "photo": ".png"
            },
            {
                "name": "Jefferson Jadoc",
                "photo": ".png"
            }
        ]
    },
    "incognito": {
        "slug": "incognito",
        "group_name": "Incognito",
        "poster": "Incognito.png",
        "title": "Intelligent Chatbot for Barangay Complaint Services using Natural Language Processing, Decision Trees, and Queue",
        "abstract": "",
        "description": "A chatbot system that lets the citizens of Barangay Mapulang Lupa to file a complaint within their local government. The system was developed through Python using Natural Language Processing algorithms such as entity recognition. The user can speak Tagalog while interacting with the chatbot. The system aims to replace the traditional pen and paper way of filing a complaint and let the locals file in their homes.",
        "group_photo": "Incognito",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "Steven Go",
                "photo": ".png"
            },
            {
                "name": "Adrian Levi Urrutia",
                "photo": ".png"
            },
            {
                "name": "Raven John Salvador",
                "photo": ".png"
            },
            {
                "name": "Geoffrey Abis",
                "photo": ".png"
            }
        ]
    },
    "kairos": {
        "slug": "kairos",
        "group_name": "Kairos",
        "poster": "Kairos.png",
        "title": "Pet Lifestyle Matcher and Adoption Application Using Recommendation Algorithms",
        "abstract": "Similarities between the potential adopter and pets are critical and contribute to a high likelihood of adoption success. Several factors must be evaluated prior to committing to adopting a pet, including one's lifestyle and personality. Pet owners encounter difficulties when acquiring a pet such as experiencing problems with the pet's behavior, finding that their pet is incompatible with other pets and themselves, having preconceived expectations that failed to be met after adopting, and developing issues with their health and household. All of these lead to unsuccessful pet adopts and eventual pet returns [1]. To help address this issue, the proponents came up with an application that will aid in decreasing the cases of pet abandonment and pet returns to animal shelters. The application will determine the compatibility between potential pet adopters and pets via questionnaires. It will then use recommendation algorithms and the multi-criteria decisionmaking approach to recommend pets to potential adopters. The proponents surveyed 22 respondents. 16 of whom were potential pet adopters, 4 were CS/IT professionals, and 2 were animal shelters. Adapting ISO 25010 - specifically functionality, reliability, usability, and efficiency - a total average of 4.37 were gathered from potential pet adopters, 4.33 from CS/IT Professionals, and 4.50 from Non-profit animal shelters. These values affirm that the application has indeed piqued its target market's interest in the application. For future studies, the proponents recommend for the application to have an iOS version, an in-app messaging option, a flowchart on how the application works, a feedback feature for successful adoptions, a feature where shelters can post pets' updates, and a filter function for the animal list.",
        "description": "PETNERSHIP is a pet lifestyle matcher and adoption mobile application that caters to both animal shelters and pet adopters. Through a recommendation algorithm, it generates the top 3 most compatible pets for the aspiring adopter based on their preferences and the pets' characteristics. The pets in the system are cats and dogs under the care of nonprofit animal shelters. PETNERSHIP matches one to their ideal partner in life while easing animal shelters' load and complementing their adoption processes.",
        "group_photo": "Kairos",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "Krysch Chalia Atienza",
                "photo": "34.png"
            },
            {
                "name": "Rahmat Zaina Isnain",
                "photo": "30.png"
            },
            {
                "name": "Jannel Lacbain",
                "photo": "25.png"
            },
            {
                "name": "Roland Val Tristan Bonus",
                "photo": "27.png"
            }
        ]
    },
    "kamigami": {
        "slug": "kamigami",
        "group_name": "Kamigami",
        "poster": "Kamigami.png",
        "title": "SENYAS: A Web-based Filipino Sign Language Learning Application with Image Detection using CNN and Boyer-Moore Algorithm",
        "abstract": "",
        "description": "SENYAS is a web-based application designed to teach Filipino Sign Language (FSL) through image detection technology powered by Convolutional Neural Networks (CNNs). The app provides video tutorials, with interactive quiz-type examination and real-time feedback to help users progress in their FSL learning journey. Whether you are a beginner or an advanced learner, SENYAS is designed to meet your learning needs. With SENYAS, individuals can improve their communication skills with the deaf community and make a positive impact in their daily lives.",
        "group_photo": "Kamigami",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "Raphael Jericho Barlin",
                "photo": ".png"
            },
            {
                "name": "Andrei Josef Nicolas",
                "photo": ".png"
            },
            {
                "name": "Princess Bea Castillo",
                "photo": ".png"
            },
            {
                "name": "Aaron Marleon Seth Uson",
                "photo": ".png"
            }
        ]
    },
    "lambdainvariants": {
        "slug": "lambdainvariants",
        "group_name": "Lambda Invariants",
        "poster": "LambdaInvariants.png",
        "title": "Mutlimodal Generative Design: An Approach to Streamline Design Workflows using Generative Adversarial Networks",
        "abstract": "",
        "description": "Meshr aims to enable designers to streamline their design process. This app makes use of the Latent Diffusion model to produce a unique and high-quality image. We provide the users multimodal interface to guide their design process by enabling them to interact with text-guided image generation, sketching a scene, or deriving alternative forms of an image. Meshr is designed with a low cognitive overhead so anyone without a design background can enjoy its rich features.",
        "group_photo": "Lambda Invariants",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "Dave Arthur Amiana",
                "photo": ".png"
            },
            {
                "name": "John Kevin Cortes",
                "photo": ".png"
            },
            {
                "name": "Akio Allen Yapan",
                "photo": ".png"
            },
            {
                "name": "Kendrew Javelosa",
                "photo": ".png"
            }
        ]
    },
    "llp": {
        "slug": "llp",
        "group_name": "LLP",
        "poster": "LLP.png",
        "title": "A Web-based Application for the Detection of Dengue Fever using Convolutional Neural Network",
        "abstract": "This study aims to help Yoga practitioners who are either keen on learning how to properly perform the various postures involved in Yoga, or to those who want to practice Yoga at home without paying for classes and having to travel a lot by providing them with a way to verify whether their posture is correct with a single snapshot. The proponent’s goal is to make Yoga a more accessible practice to the general public by offering them a handheld Yoga Guru whose main purpose is to ensure that they are correctly performing the various poses that are involved in the practice without the need for enrolling in an expensive Yoga class or by hiring a Yoga guru. With this in mind, Yoga as practice is advertised as an activity which is accessible to everyone due to its low demands in external tools and physical requirements. According to the U.S. Consumer Product Safety Commission in 2019, there were more than 34,000 Yoga related injuries sustained during that year alone. The implementation of this application would eliminate the fear of practicing Yoga wrongfully which could lead to long-standing chronic problems which is commonly caused by repetitive strain to and overstretching of the neck, shoulders, spine, legs, and knees. With the aid of a Yoga Guru with more than 10 years of experience the proponents were able to produce an application consisting of 11 Yoga Asanas or postures divided into three Yoga flows that is able to track and assess its users whilst practicing Yoga. This was done with the implementation of Convolutional Neural Networks, K-Nearest Neighbors algorithm, and CNN G-HUM BlazePose 3D Models. ",
        "description": "GURU is an android application aimed to detect yoga postures by accessing the camera and detecting the human body. It is able to assess and track 11 yoga postures divided into 3 yoga flows with the use of CNN among other algorithms. The application is intended for people both beginner and advanced in helping them practce yoga in a safe manner and make yoga a more safe and fun",
        "group_photo": "LLP",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "Andrey Levy Pulusan",
                "photo": ""
            },
            {
                "name": "Robert Michael Aquino",
                "photo": "43.png"
            },
            {
                "name": "Jeramy Galor",
                "photo": "46.png"
            },
            {
                "name": "Jamille Jose Quigao",
                "photo": "44.png"
            }
        ]
    },
    "loveableboys": {
        "slug": "loveableboys",
        "group_name": "Loveable Boys",
        "poster": "Loveable-Boys.png",
        "title": "A Secure and Safe Application Using Hybrid Cryptography Based End-to-End Encryption and Explicit Image Filtering",
        "abstract": "EfasChas is a social messaging application that uses hybrid cryptography-based end-to-end encryption (E2EE) with explicit image filtering to provide a secure and safe platform for users to communicate and exchange content. The explicit content detector (ECD) feature, a trained model using Convolutional Neural Network to classify images, achieved 88% accuracy in detecting explicit images, preventing the sending of the image to another user and protecting the users from seeing such images. In addition to the application, it uses hybrid cryptography, which combines symmetric (Advanced Encryption Standard) and asymmetric (Rivest-Shamir-Adleman) encryption to secure the communication between users and the server, ensuring only authorized users have access to the transmitted messages. Through user evaluation and testing, we found that the majority of the respondents strongly agreed that the ECD feature and the encryption mechanism to them messages effectively protected their privacy and made the more likely to use the application.",
        "description": "This program is a safe and secure tool that employs end-to-end encryption in cooperation with hybrid cryptography to safeguard user data. In order to ensure that only relevant content is shared, it also includes explicit image filtering. Users of the program can be assured of a high level of security, preventing unauthorized access to personal information and maintaining the confidentiality of their communications.",
        "group_photo": "Loveable Boys",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "James Ralph Balagtas",
                "photo": "68.png"
            },
            {
                "name": "Paul Kristopher Espina",
                "photo": "75.png"
            },
            {
                "name": "Francis Miguel Dela Cruz",
                "photo": "71.png"
            },
            {
                "name": "Reggie Noel Guday",
                "photo": "73.png"
            }
        ]
    },
    "nakakapagpagabag": {
        "slug": "nakakapagpagabag",
        "group_name": "Nakakapagpabagabag",
        "poster": "Nakakapagpabagabag.png",
        "title": "Android Mobile Application for Detecting Fake Medicine Packaging Through Application of Image Processing",
        "abstract": "",
        "description": "A mobile application called PharmaScanner aids in determining a medicine's legitimacy by scanning its packaging. It contains a capability that enables the user to upload or capture a photograph of a medicine. In order to speed up the system's processing, Convolutional Neural Network (CNN) will be employed as the classification model in conjunction with GPU.",
        "group_photo": "Nakakapagpabagabag",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "Eduardo Villanueva",
                "photo": ".png"
            },
            {
                "name": "Nicole Anne Mabale",
                "photo": ".png"
            },
            {
                "name": "Renee Anne Joy Gula",
                "photo": ".png"
            }
        ]
    },
    "providence": {
        "slug": "providence",
        "group_name": "Providence",
        "poster": "Providence.png",
        "title": "Detection and Classification of Malaria: An Image Processing and Deep Learning Program Study",
        "abstract": "",
        "description": "An application tool designed to be used on a desktop capable of detecting malaroa and being able to classify its parasites with the use of captured blood smeared images. The application was developed through python with the implementation of YOLOv4 with image processing algorithms  to enhance its detection. The applications purpose is to be a right-hand tool for medical professionals to reduce the workload on a quickpace working environment",
        "group_photo": "Providence",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "William Romano",
                "photo": ".png"
            },
            {
                "name": "Michael Angelo Mendoza",
                "photo": ".png"
            },
            {
                "name": "Andrey Leynes",
                "photo": ".png"
            },
            {
                "name": "Syrill Bobadilla",
                "photo": ".png"
            }
        ]
    },
    "quaranteam": {
        "slug": "quaranteam",
        "group_name": "Quaranteam",
        "poster": "Quaranteam.png",
        "title": "CURITY: Emergency/SOS Button for Crime Prevention in Manila",
        "abstract": "",
        "description": "The Curity app is an android application which contains a button that will be pressed by the user. Once the user releases the button a confirmation message will appear. If the user was not able to respond in a given time, the application will send its location to the Official Authorities which contains valuable information that will help find the user.",
        "group_photo": "Quaranteam",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "Jenerose Corpuz",
                "photo": ".png"
            },
            {
                "name": "Elyzza Jane Abrigo",
                "photo": ".png"
            },
            {
                "name": "Ella Fritz Sarmiento",
                "photo": ".png"
            },
            {
                "name": "Geraldine Sophia Quizon",
                "photo": ".png"
            }
        ]
    },
    "samgroupsal": {
        "slug": "samgroupsal",
        "group_name": "Samgroupsal",
        "poster": "Samgroupsal.png",
        "title": "Cobb Angle Digital Measurement Mobile Application: An Object and Landmark detection application for diagnosing scoliosis using Convolutional Neural Network",
        "abstract": "",
        "description": "CADMA is a mobile application that utilize object detection, landmark detection, and convolutional neural network that can automate the manual measurement of the spine's cobb angle and classify the gathered data depending on the guidelines set for each scoliosis type.",
        "group_photo": "Samgroupsal",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "Jerome Tiuzen",
                "photo": ".png"
            },
            {
                "name": "John Deniel Coronel",
                "photo": ".png"
            },
            {
                "name": "Kent Vincent Dimla",
                "photo": ".png"
            },
            {
                "name": "Franz Millan De Vera",
                "photo": ".png"
            }
        ]
    },
    "semicolonizers": {
        "slug": "semicolonizers",
        "group_name": "semicolonizers;",
        "poster": "Semicolonizers.png",
        "title": "Area Occupancy Detection using Computer Vision and Machine Learning",
        "abstract": "In this paper proposed a system in which it is described as a way to detect occupancy levels through the use of existing surveillance infrastructure installed on modern rooms to solve an issue where varying occupancy on certain times and dates mean losing time on the preparation of one's trip. Using the YOLOv5 Object Detection algorithm, the Time Series models for prediction of the number of people in a room, as well as a web interface for universal access of information, the proponents of this study prepared a proof-of- concept that demonstrates how effective the system is, even with just a use of a web camera. In tests, the YOLOv5 scored a 61% to 78% accuracy, and it performs enough to determine an area's occupancy, with a correlation of 0.56 for head detection, meaning that it is moderately correlated, and 0.31 for body detection, which means that it is fairly correlated. Prediction models are also able to loosely predict peak area occupancy with tests setting its peak detection in the afternoon. In addition, an evaluation based on the ISO 25010 standard is performed to 30 respondents, in which all eight categories scored a \"strongly agree\" on each. Despite delays, the developed system performs well in identifying and predicting occupancy of an area through object detection and classification in record time. In addition, a month-long testing of the system is performed to allow the evaluation of the said system, and based on the study's results, majority of the respondents agree that the use of this system can aid in resolving the problems of people with regards to building occupancy. ",
        "description": "A proof-of-concept system powered by Python that determines an area's occupancy using off-the-shelf camera systems and the YOLOv5 object detection algorithm, and aims to provide predictive occupancy readings from historical data of the room. This proof-of-concept showcases an application of this system to provide a web interface showing room occupancy, as well as systems to manage and notify specified recipients on any updates by the system",
        "group_photo": "project-border.png",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "Marc Steven Clemen",
                "photo": "173.png"
            },
            {
                "name": "Aerhiel Dhenhice Bisnan",
                "photo": "170.png"
            },
            {
                "name": "Janah Reginna Ignacio",
                "photo": "177.png"
            },
            {
                "name": "Juan Miguel Duran",
                "photo": "175.png"
            }
        ]
    },
    "sixsteveneight": {
        "slug": "sixsteveneight",
        "group_name": "SixStevenEight",
        "poster": "SixStevenEight.jpg",
        "title": "Identification of Influencers using a Recommendation System Developed through Social Network Analysis and Graph Theory",
        "abstract": "Influencers utilize different social media platforms to engage with their respective audiences. The aim of this study was to develop a system that could provide recommendations on which influencer to choose to help out on a specific business problem. This study developed a system based on Twitter as this micro-blogging site has not officially developed any Recommender System for their platform. The proponents of this study applied multiple algorithms to create unique functions, namely: Influence Scoring Formula by Abdessamad Essaidi et. al for Influence Ranking, Breadth-First Search and Longest Path for Reach and Engagements, Louvain Algorithm and Betweenness Centrality for Gatekeeper Identification. The system has been evaluated by 40 respondents. It was composed of 20 entrepreneurs/business owners, 10 CS/IT professionals and 10 Twitter users. The result of the evaluation, 4.11 [entrepreneurs/business owners], 4.50 [CS/IT professionals], 3.78 [Twitter users], showed that all of the respondents can be considered Satisfied with the system. However, the results also pointed out that efficiency requires to be improved and written feedback from respondents wanted major changes on user interface. Finally, full archive or highest level access to Twitter user's dataset is the greatest recommendation for shorter time in processing output and to drastically improve efficiency. For future researchers, models based on other social platforms are recommended.",
        "description": "An application built from multiple combinations of algorithms provides three key features for identifying the best Twitter influencer for a job. Its objective is to generate recommendations based on set parameters and business goals. Our application should help distinguish the notable Twitter influencers from their domain. Companies, organizations, and other entities looking for Twitter influencers could come in contact with us in order to help them find the most suitable influencer for their respective endeavors.",
        "group_photo": "SixStevenEight",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "Harley Steven Vegara",
                "photo": "82.png"
            },
            {
                "name": "James Florence Conales",
                "photo": "78.png"
            },
            {
                "name": "Korj Phillip Luna",
                "photo": "80.png"
            },
            {
                "name": "Medrick Amis",
                "photo": "77.png"
            }
        ]
    },
    "takoyaki": {
        "slug": "takoyaki",
        "group_name": "Takoyaki",
        "poster": "Takoyaki.png",
        "title": "BAYBAYIN: A Mobile Intelligent Tutoring System to Detect Signs of Functional Speech Sound Disorder in Selected Grade 1 Pupils in Quezon City Learning Proper Filipino Pronunciation",
        "abstract": "When the COVID-19 happened, suspending in-person classes and work has been most efficient and practical way to prevent virus from spreading. This pandemic has made it more challenging for teachers and parents to ensure that young learners learn, understand, and practice specific skills. The proponents focused on examining the pronunciation skills of selected Grade 1 pupils of Ste. Anne de Beupré School to observe any signs that might be linked to potentially having Speech Sound Disorder. The study aims to detect the signs of Functional Speech Sound Disorder (FSSD) by providing exercises that follow the standard speech sound test commonly conducted by the SLP and observing the frequency of mispronunciations committed. The system is programmed to help the user pronounce Filipino words correctly by generating hints and help the concerned parents and teachers better understand and know what help they can provide the learners by generating graphs based on the usage and performance of each pupil. The system is programmed to help the user pronounce Filipino words correctly by generating hints and help the concerned parents and teachers better understand and know what help they can provide the learners by generating graphs based on the usage and performance of each pupil. The testers and their parents and teachers found that the prototype and its functions were satisfactory as they were able to receive the appropriate feedback on the speech detected, that the pupils were able to learn from the sample audio provided in order to let them hear the expected pronunciation, and that the teachers and parents were able to better understand the learners` and their strengths and weaknesses in terms of pronunciation when the prototype presented them the data in graphs.",
        "description": "Baybayin is a mobile application capable of Detecting signs of Functional Speech Sound Disorder while guiding young Filipino learners in learning and practicing the proper pronunciation of Filipino words. With the help of audio guides as hints, appropriate pronunciation assessment, and graphs of the summary of the learners' progress and performance, the application aspires to help the concerned parents, guardians, and language instructors better understand and know the type of assistance that the pupils need.",
        "group_photo": "Takoyaki",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "Junelle Espero",
                "photo": "67.png"
            },
            {
                "name": "Ishmael Bautista",
                "photo": "60.png"
            },
            {
                "name": "Jerloy Mathew Tudio",
                "photo": "63.png"
            },
            {
                "name": "Mark Martin Banuelos",
                "photo": "62.png"
            }
        ]
    },
    "tonyongbayawak": {
        "slug": "tonyongbayawak",
        "group_name": "Tonyong Bayawak",
        "poster": "Tonyong-Bayawak.png",
        "title": "Developing predictive model using LSTM on AXS for Long-Term AXS Investors",
        "abstract": "",
        "description": "This crypto forecasting website for the popular NFT game cryptocurrency AXS provides real-time current and historical price analysis, Future price forecast analysis based on historical data, and machine learning using LSTM. Users can access the platform to make informed investment decisions, and stay updated on the latest AXS news and developments.",
        "group_photo": "Tonyong Bayawak",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "Joshua Miguel Tuan",
                "photo": ".png"
            },
            {
                "name": "Jerwin Peralta",
                "photo": ".png"
            },
            {
                "name": "Anna Mae Kathryn Co",
                "photo": ".png"
            },
            {
                "name": "Jericho Pilapil",
                "photo": ".png"
            }
        ]
    },
    "vaccshift": {
        "slug": "vaccshift",
        "group_name": "Vaccshift",
        "poster": "Vaccshift.png",
        "title": "iCHOR: Classification of Different Red Blood Cell Abnormalites using Deep Learning",
        "abstract": "The Philippines is plagued by its lack of healthcare workers and access to basic healthcare. Hence, some Filipinos are struggling to help themselves when it comes to diseases. The hematology sector is no different because although there are ways to detect abnormalities in the blood, such as the peripheral blood smear test and digital morphological analyzers, both give off disadvantages that can affect the speed and accuracy of the results. In addition to the medical issues stated above, the field has not embraced digitization yet, which is a loss, as technology can be of great help in advancing our healthcare even more. The development of the system offers a solution to aid medical workers in detecting diseases within the blood, a cheaper blood test option for patients, and the introduction of another technological breakthrough to the community. To detect white blood cells, and 13 types of abnormalities in the red blood cells, the convolutional neural network algorithm is implemented, specifically, the YOLOv4 model of the You Only Look Once series, in training the machine using a validated open-sourced dataset. 45 respondents comprising Information Technology of Computer Science professionals, medical technology graduates, pathologists, and resident pathologists volunteered to evaluate the desktop application. The respondents rated the application an average of 0.99 out of 1.0 across the categories according to ISO 9126-1 and reflects to be satisfactory. For future studies, there are recommendations to further the training process of the machine, better the user interface of the program, ability to import multiple images, and add color-based abnormalities.",
        "description": "iCHOR is a desktop application that detects and classifies 11 types of red blood cell abnormalities in a human's peripheral blood smear, in which each carries a different disease. Furthermore, it can save the red blood cell count per type, and the possible related diseases in a database. It aims to aid medical practitioners in their patients' diagnosis - a faster, cheaper, and more efficient way than the traditional method of manually checking each type of cell. This application is made through Python with a Convolutional Neural Network algorithm, specifically, the You Only Look Once 4 model- a common algorithm used in the medical field. With an 80% confidence threshold, iCHOR ensures that it is the gateway to efficient hematology.",
        "group_photo": "Vaccshift",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "Christiana Aleyna Sy",
                "photo": "2.png"
            },
            {
                "name": "Seira Siez Santiago",
                "photo": "4.png"
            },
            {
                "name": "Micah Pablo",
                "photo": "8.png"
            },
            {
                "name": "Marielle Vaay",
                "photo": "6.png"
            }
        ]
    },
    "version1": {
        "slug": "version1",
        "group_name": "Version-1",
        "poster": "Version-1.png",
        "title": "Chat, Meet, Eat - Android Based Social Media Application that Uses an Information Filtering Algorithm and Recommender System for Matching Individuals to Groups",
        "abstract": "",
        "description": "Chat, meet, eat is an android based application that uses information filtering algorithm and recommender system to match individuals to groups consisting of people with similar preferences and interest to chat with each other. This is to create the opportunity for likewise individuals to be able meet over a meal and get to know each other while also overall improving their dining experience.",
        "group_photo": "Version-1",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "Aldwin Rivera",
                "photo": ".png"
            },
            {
                "name": "Kenn Gudez",
                "photo": ".png"
            },
            {
                "name": "Albert Josh Dizon",
                "photo": ".png"
            },
            {
                "name": "Mark Llanes",
                "photo": ".png"
            }
        ]
    },
    "visum": {
        "slug": "visum",
        "group_name": "Visum",
        "poster": "Visum.png",
        "title": "Classifying Selected Invasive Plants in the Philippines using Convolutional Neural Network and K-Nearest Neighbor Classifier to Reduce Ecological and Economic Impact",
        "abstract": "",
        "description": "This software aims to tackle the issue of invasive plants in the Philippines by using a combination of machine learning techniques. It utilizes Convolutional Neural Network (CNN) and K-Nearest Neighbor (KNN) classifiers to accurately classify selected invasive plant species, helping to reduce their ecological and economic impact.",
        "group_photo": "Visum",
        "group_avp": "https://example.com",
        "group_manuscript": "https://example.com",
        "developers": [
            {
                "name": "John Benedict Villacorta",
                "photo": ".png"
            },
            {
                "name": "Kenji Shimizu",
                "photo": ".png"
            },
            {
                "name": "James Lanbert Javier",
                "photo": ".png"
            },
            {
                "name": "Karl Michael Marcellana",
                "photo": ".png"
            }
        ]
    }
}