{
    "speakers": [
        {
            "event_id": "cs-expo",
            "speakers": [
                {
                    "name": "Anthony De Luna",
                    "credential": "President and CEO, Flipside AI",
                    "bionote": "Anthony De Luna leads Flipside AI, an artificial intelligence (AI) data labeling services company as its Founder, President and Chairperson of the Board. Flipside AI focuses on computer vision and perception applications, specializing in machine learning data for autonomous vehicles, robotics and geospace. Anthony also concurrently serves as Chairperson of the Board of Pouch Philippines, Inc., a Web3 FinTech/app startup utilizing the Lightning Network - Layer 2 of the Bitcoin blockchain. Anthony has over 30 years of international management experience, including leadership roles in technology and strategy. He built an ebook platform in 2011 and sold it to Globe Telecom in 2016. Anthony is intrigued by disruptive technologies. After reading about Steve Jobs and Bill Gates while he was in college-dreaming of their accomplishments-he regrettably dropped out of his Electrical Engineering course at Mapua Institute of Technology. He obviously did not become the next Jobs or Gates, so Anthony does not recommend dropping out; he instead encourages the pursuit of advanced degrees.",
                    "photo": "AnthonyDeLuna.jpeg",
                    "talk_title": "AI: Assistance or Replacement?"
                }
            ]
        },
        {
            "event_id": "devday",
            "speakers": [
                {
                    "name": "Cherry Murillon",
                    "credential": "Founder-Chief Executive Officer, Cawil.AI Solutions",
                    "bionote": "Ma'am Cherry has experience as a CFO and business development focusing on partnerships in the ports and maritime industry as well as AI technology. Additionally, she has experience in science and research, specifically in environmental applications and computer vision research. She has received various awards and recognitions for her work, including being chosen as one of the \"Startup Pinay Founders\" for the Singapore Week of Innovation and Technology (SWITCH) Philippine Delegate and being an alumni founder of Ideaspace Foundation. In addition, she has also participated in various acceleration and mentorship programs, including the AWS ASEAN Women Founders Mentorship Program and the PortXL First Maritime Acceleration Program. She holds a Bachelor of Science in Chemistry from Mapua University and has completed various entrepreneurship and management programs from the Asian Institute of Management.",
                    "photo": "CherryMurillon.png",
                    "talk_title": "Maximizing the Power of Image Processing to Improve Day-to-Day Functions"
                },
                {
                    "name": "Terrence Errard D. Teh",
                    "credential": "Data Science, BPI",
                    "bionote": "Terrence currently heads BPI's Data Science & Analytics division, where he works with a large multidisciplinary group of data scientists, analysts, and strategists, to drive maximum opportunities and value to the enterprise through thorough and responsible use of AI and data. He is also acting OIC of the Bank's Customer Insights & Analytics team, which provides strategic and tactical support to various business units towards BPI's mission of becoming a customer-centric organization. Prior to joining the Bank, he studied Mathematics at the University of the Philippines-Diliman as a recipient of the DOST ASTHRDP Scholarship. As a researcher, he specializes in applications of Functional Analysis and Matrix Theory, having published and presented his work locally and abroad. As an educator, he has taught high school, competitive, and undergraduate level math. He also regularly conducts general audience workshops, seminars and career talks on Data Science, AI, Mathematics, and Finance. Outside his professional endeavors, Terrence is a classically trained musician and a choral conductor. An alumnus of the world-renowned Philippine Madrigal Singers, he continues to pursue his musical interests as part of the BPI Voices Chorale. He is also an avid language learner, and is proud of his 1600-day Duolingo streak.",
                    "photo": "TerrenceTeh.jpg",
                    "talk_title": "Data Analytics and How to Keep Up with a Data-Driven Generation"
                }
            ]
        }
    ]
}